In [5]:
name = ["john", "lola", "bayo"]
ages = [30, 43, 25]

Name = []
for i in name:
    a = i[0].upper() + i.split()[0][1:]
    Name.append(a)

for n in range(len(name)):
    print(f"{Name[n]} is {ages[n]} years old")

John is 30 years old
Lola is 43 years old
Bayo is 25 years old

In [10]:
firstname = ["katie", "bicah", "lemah", "judie" ]
surname = ["tamuno"]

In [11]:
fullname = []
for j in range(len(firstname)):
    name_array = firstname[j] + " " + surname[0]
    fullname.append(name_array)
print(fullname)

['katie tamuno', 'bicah tamuno', 'lemah tamuno', 'judie tamuno']

In [3]:
import os

In [12]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is E608-7F89

 Directory of C:\Users\AS\Desktop\data_analytic\pythonCodes

11/08/2022  02:46 PM    <DIR>          .
11/08/2022  02:46 PM    <DIR>          ..
11/04/2022  06:55 PM    <DIR>          .ipynb_checkpoints
11/08/2022  11:53 AM            28,861 Assignments.ipynb
11/07/2022  04:58 PM                22 dataSheets.txt
11/08/2022  12:00 PM                56 newname.txt
11/08/2022  11:58 AM               112 new_filename.txt
11/07/2022  05:08 PM               384 new_temp.txt
11/08/2022  02:46 PM             4,541 Practice.ipynb
11/08/2022  11:54 AM    <DIR>          Untitled Folder
11/08/2022  11:54 AM    <DIR>          Untitled Folder 1
               6 File(s)         33,976 bytes
               5 Dir(s)  254,180,364,288 bytes free

In [8]:
print_file = open("newname.txt", "a")
for n in fullname:
    print_file.write(f"{n}\n")

### Matrices

In [1]:
a = [["name", "age", "score"],
     ["funmi", "27", "78"],
     ["bola", "30", "90"]]

print(a[0][0])
print(a[1][0])
print(a[2][0])

name
funmi
bola

In [2]:
print(a[0][1])
print(a[1][1])
print(a[2][1])

age
27
30

In [90]:
for i in range(0, 3):
    for j in range(0, 3):
        print(i, j)
        #print(a[i][j])

0 0
0 1
0 2
1 0
1 1
1 2
2 0
2 1
2 2

In [8]:
a = [["name", "age", "score"],
     ["funmi", "27", "78"],
     ["bola", "30", "90"]]

In [26]:
import pandas as pd
df = pd.DataFrame(a[1:], columns=a[0])
df

    name age score
0  funmi  27    78
1   bola  30    90

In [8]:
a[2][0]

'bola'

In [44]:
for i in range(0, len(a)):
    index_value = []
    for n in a:
        index_value.append(n[i])
    print(index_value)

['name', 'funmi', 'bola']
['age', '27', '30']
['score', '78', '90']

In [62]:
new_arr = []
for i in range(0, 3):
    arr = []
    for n in a:
        arr.append(n[i])
    new_arr.append(arr)
print(new_arr)

[['name', 'funmi', 'bola'], ['age', '27', '30'], ['score', '78', '90']]

In [11]:
for a in range(0, 3):
    for n in range(3, 6):
        print(a, n)

0 3
0 4
0 5
1 3
1 4
1 5
2 3
2 4
2 5

In [82]:
b = [9, 10, 11, 2, 7]

#sum any index that would give you 18

for j in range(0, len(b)):
    for d in range(j+1, len(b)):
        k = [b[j], b[d]]
        if sum(k) == 20:
            print(b[j], b[d])

9 11

In [13]:
a = [["name", "age", "score"],
     ["funmi", "27", "78"],
     ["bola", "30", "90"]]

In [14]:
a[0][2], a[1][1], a[2][0]

('score', '27', 'bola')

In [15]:
a[i]

['bola', '30', '90']

In [16]:
list_arr = [[1, 2, 4, 9],
           [9, 10, 12, 8],
           [4, 43, 11, 7]]
print(list_arr)

[[1, 2, 4, 9], [9, 10, 12, 8], [4, 43, 11, 7]]

In [17]:
new_arr = []
for i in range(0, len(list_arr[0])):
    arr = []
    for n in list_arr:
        arr.append(n[i])
    new_arr.append(arr)
print(new_arr)

[[1, 9, 4], [2, 10, 43], [4, 12, 11], [9, 8, 7]]

In [99]:
a = [["name", "age", "score"],
     ["funmi", "27", "78"],
     ["bola", "30", "90"],
     ["bola", "30", "90"]]

### Assignment

In [115]:
arr_list = []
for i in range(0, len(a)):
    print(i)
    for j in range(0, len(a[0])):
        print(a[i], [j])
        #print(k)
        if (k == 2):
            arr_list.append(a[i][j])
#print(arr_list)

0
['name', 'age', 'score'] [0]
['name', 'age', 'score'] [1]
['name', 'age', 'score'] [2]
1
['funmi', '27', '78'] [0]
['funmi', '27', '78'] [1]
['funmi', '27', '78'] [2]
2
['bola', '30', '90'] [0]
['bola', '30', '90'] [1]
['bola', '30', '90'] [2]
3
['bola', '30', '90'] [0]
['bola', '30', '90'] [1]
['bola', '30', '90'] [2]

In [80]:
num = (1, 3, 5, 6, 4)

sum = 0
for i in num:
    sum = sum + i
print(sum)

19

In [78]:
name = []
for i in range(0, 3):
    for j in range(0, 3):
        name.append(a[i][j])
print(name)

['name', 'age', 'score', 'funmi', '27', '78', 'bola', '30', '90']

In [93]:
for i in range(0, len(a)):
    b = len(a)-1
    for d in range(0, len(a)):
        b = -b -(-i)
    print(a[i][-b])

score
27
bola

In [81]:
for i in range(0, 3):
    print(a[i][2-i])

score
27
bola

### Dictionaries

In [13]:
# Dictioneries are key-value pairs

dict_val = {"name": "ola", "age": 50, "occupation": "datascientist"}
print(dict_val)

{'name': 'ola', 'age': 50, 'occupation': 'datascientist'}

In [14]:
print(dict_val)

{'name': 'ola', 'age': 50, 'occupation': 'datascientist'}

In [120]:
dict_val["salary"] = 5500
print(dict_val)

{'name': 'ola', 'age': 50, 'occupation': 'datascientist', 'salary': 5500}

In [16]:
for i, b in dict_val.items():
    print(i, b)

name ola
age 50
occupation datascientist

In [125]:
f_dic = {"name":["james", "kate", "made"], "age":[20, 30, 40], "marital_status":[True, False, True]}
print(f_dic)

{'name': ['james', 'kate', 'made'], 'age': [20, 30, 40], 'marital_status': [True, False, True]}

In [126]:
import pandas as pd

In [127]:
pd.DataFrame(f_dic)

    name  age  marital_status
0  james   20            True
1   kate   30           False
2   made   40            True

In [129]:
pd.DataFrame([dict_val])

  name  age     occupation  salary
0  ola   50  datascientist    5500

In [28]:
dict_arr = [{"name":"john", "age":30, "credit_score":20},
            {"name":"jake", "age":40, "credit_score":55},
            {"name":"ada", "age":25, "credit_score":44}]
print(dict_arr)

[{'name': 'john', 'age': 30, 'credit_score': 20}, {'name': 'jake', 'age': 40, 'credit_score': 55}, {'name': 'ada', 'age': 25, 'credit_score': 44}]

In [29]:
pd.DataFrame(dict_arr)

   name  age  credit_score
0  john   30            20
1  jake   40            55
2   ada   25            44

In [149]:
for i in dict_arr:
    for a, b in i.items():
        if i["age"] >=30:
            i["credit_score"] = i["credit_score"] + i["credit_score"] * 0.1
            print(i)
        break

{'name': 'john', 'age': 30, 'credit_score': 47.158953819999994}
{'name': 'jake', 'age': 40, 'credit_score': 129.687123005}

In [14]:
a = [10, 10, 10, "John", True, False, False, 3, 10, False, False, False]

In [23]:
hash_tab = {}
for i in a:
    hash_tab[i] = hash_tab.get(i,0) + 1
print(hash_tab)

{10: 4, 'John': 1, True: 1, False: 5, 3: 1}

In [25]:
vals = []
for n,m in hash_tab.items():
    vals.append(m)
print(vals)

[4, 1, 1, 5, 1]

In [45]:
max_vals = vals[0]
for i in vals:
    if i > max_vals:
        max_vals = i
    print(max_vals)

4
4
4
5
5

In [68]:
for i, j in hash_tab.items():
    if j == max_vals:
        print(i)

False

In [163]:
hash_tab = {}
max_vals = vals[0]
vals = []

for i in a:
    hash_tab[i] = hash_tab.get(i,0)+1
for n,m in hash_tab.items():
    vals.append(m)
max_vals = vals[0]
for i in vals:
    if i > max_vals:
        max_vals = i
for i, j in hash_tab.items():
    if j == max_vals:
        print(f"{i} and the count of {i} is ==> than {j}")

10 and the count of 10 is ==> than 7

In [29]:
hash_table = {}
for i in a:
    hash_table[i] = hash_table.get(i, 0) + 1
print(hash_table)

{10: 4, 'John': 1, True: 1, False: 5, 3: 1}

In [48]:
val = []
for m,n in hash_table.items():
    val.append(n)
print(val)

[4, 1, 1, 5, 1]

In [55]:
max_val = val[0]
for i in val:
    if i > max_val:
        max_val = i
print(max_val)

5

In [60]:
for m,n in hash_table.items():
    if n == max_val:
        print(f"The highest count of values is '{m}' which occurs {n} times")

The highest count of values is 'False' which occurs 5 times

## Functions

In [1]:
print("cindy")

cindy

In [2]:
def name_val():
    return "cindy"

print(name_val())

cindy

In [3]:
def name_val(name):
    return name

print(name_val("cindy"))

cindy

In [6]:
#a = velocity/time
#velocity = d/t

In [5]:
def velocity(d, t):
    vel = d/t
    return vel

#velocity - velocity(200, 20)
#print(velocity)

In [7]:
def accel(vel, t):
    acc = vel/t
    return acc

In [8]:
def force_val(mass, acc):
    f = mass * acc
    return f

velocity = velocity(200, 20)
accl = accel(velocity, 15)
force = force_val(50, accl)
print(velocity)
print(accl)
print(force)

10.0
0.6666666666666666
33.33333333333333

In [74]:
def count_array(array_val):
    dict_arr = {}
    for i in array_val:
        dict_arr[i] = dict_arr.get(i, 0) + 1
    return dict_arr

def get_values(dict_arr):
    vals = []
    for a, b in dict_arr.items():
        vals.append(b)
    return vals

def max_vals_func(vals):
    b = vals[0]
    for i in vals:
        if i > b:
            b = i
    return b

def compare_array(dict_arr, b):
    for l, n in dict_arr.items():
        if n == b:
            return l

new_val = [20, 14, 20, "emma", 20, 14, True, "emma", 20]
arr_g = [False, False, 8, 15, 8, 9, 8, 15, 8, False]

x = count_array(new_val)
k = get_values(x)
max_t = max_vals_func(k)
final_ans = compare_array(x, max_t)
print(x)
print(k)
print(max_t)
print(final_ans)

{20: 4, 14: 2, 'emma': 2, True: 1}
[4, 2, 2, 1]
4
20


### DataFrames

In [12]:
arr = [5, 10, 15, 20]
print(arr)

[5, 10, 15, 20]

In [48]:
dt = [[30, 19, 17, 18], ["a", "b", "c", "d"], [10, 20, 30, 40], [8, 9, 10, 11]]
print(dt)

[[30, 19, 17, 18], ['a', 'b', 'c', 'd'], [10, 20, 30, 40], [8, 9, 10, 11]]

In [49]:
import pandas as pd
df = pd.DataFrame(dt[1:], columns=dt[1])
df = df.drop(0)

In [50]:
a_df = df.drop('d', axis=1)
new_df = a_df.reset_index()

In [51]:
new_df = new_df.drop('index', axis=1)
new_df

    a   b   c
0  10  20  30
1   8   9  10

In [40]:
a_df['b'].values

array([20, 9], dtype=object)

In [41]:
a_df.iloc[0].values

array([10, 20, 30], dtype=object)

In [42]:
df.T

    1   2
a  10   8
b  20   9
c  30  10
d  40  11

In [53]:
id_info = [[1001, 1002, 1003], ['kate', 'mark', 'janeth'], [102, 105, 97]]
data_df = pd.DataFrame(id_info).T
data_df.columns = ["id", "name", "credit_score"]
data_df

     id    name credit_score
0  1001    kate          102
1  1002    mark          105
2  1003  janeth           97

In [65]:
arr_dict = {"id":[1002, 1001, 1003],
           "payment_info": ["paid", "pending", "reversed"]}
df_data = pd.DataFrame(arr_dict)
df_data

     id payment_info
0  1002         paid
1  1001      pending
2  1003     reversed

In [55]:
merged_data = pd.merge(data_df, df_data, on = "id")
merged_data

     id    name credit_score payment_info
0  1001    kate          102      pending
1  1002    mark          105         paid
2  1003  janeth           97     reversed

In [64]:
dt = {"id":[1004, 1005, 1006],
     "payment_info": ["paid fully", "pending", "loaned"]}
df_dt = pd.DataFrame(dt)
df_dt

     id payment_info
0  1004   paid fully
1  1005      pending
2  1006       loaned

In [58]:
my_df = df_data.append(df_dt)
my_df

C:\Users\AS\AppData\Local\Temp\ipykernel_14100\3145957713.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  my_df = df_data.append(df_dt)

     id payment_info
0  1002         paid
1  1001      pending
2  1003     reversed
0  1004   paid fully
1  1005      pending
2  1006       loaned

In [60]:
concat_data = pd.concat([data_df, df_data], axis=1)
concat_data

     id    name credit_score    id payment_info
0  1001    kate          102  1002         paid
1  1002    mark          105  1001      pending
2  1003  janeth           97  1003     reversed